nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/common/pin_mux/pin_mux.h
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name GPIOF8 (number 6), J21[2]/U18[7]/SW4/WAKE_UP
  @{ */
#define BOARD_WAKE_UP_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_WAKE_UP_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_WAKE_UP_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF6 (number 58), U18[8]/J2[2]/D5/USER_LED1/INT1_COMBO
  @{ */
#define BOARD_INT1_COMBO_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INT1_COMBO_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_INT1_COMBO_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOF2 (number 39), J2[18]/U18[4]/LP_SDA0
  @{ */
#define BOARD_LP_SDA0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SDA0_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define BOARD_LP_SDA0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF3 (number 40), J2[20]/U18[5]/LP_SCL0
  @{ */
#define BOARD_LP_SCL0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SCL0_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define BOARD_LP_SCL0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

/*! @name GPIOE6 (number 53), J2[4]/J17[2]/J19[2]/SW2/PWMA_3B
  @{ */
#define BOARD_BUTTON_SW2_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_BUTTON_SW2_PIN 6U              /*!<@brief GPIOE pin index: 6 */
#define BOARD_BUTTON_SW2_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOE7 (number 54), J3[3]/J18[2]/SW3
  @{ */
#define BOARD_BUTTON_SW3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_BUTTON_SW3_PIN 7U              /*!<@brief GPIOE pin index: 7 */
#define BOARD_BUTTON_SW3_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOF8 (number 6), J21[2]/U18[7]/SW4/WAKE_UP
  @{ */
#define BOARD_BUTTON_SW4_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_BUTTON_SW4_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_BUTTON_SW4_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOC13 (number 49), J22[2]/SW5
  @{ */
#define BOARD_BUTTON_SW5_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_BUTTON_SW5_PIN 13U              /*!<@brief GPIOC pin index: 13 */
#define BOARD_BUTTON_SW5_PIN_MASK kGPIO_Pin13 /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

/*! @name GPIOC2 (number 5), U12[6]
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC3 (number 7), U12[7]
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name GPIOF4 (number 41), J1[8]/D7/USER_LED2
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_BLUE_PIN 4U              /*!<@brief GPIOF pin index: 4 */
#define BOARD_LED_BLUE_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOF5 (number 42), J1[6]/D8/USER_LED3
  @{ */
#define BOARD_LED_YELLOW_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_YELLOW_PIN 5U              /*!<@brief GPIOF pin index: 5 */
#define BOARD_LED_YELLOW_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOF6 (number 58), U18[8]/J2[2]/D5/USER_LED1/INT1_COMBO
  @{ */
#define BOARD_LED_RED_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_RED_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_LED_RED_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOE0 (number 45), J3[13]/U15A[1]/PWMA_0B
  @{ */
#define BOARD_LED0_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED0_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define BOARD_LED0_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE1 (number 46), J3[15]/U15B[3]/PWMA_0A
  @{ */
#define BOARD_LED1_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED1_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define BOARD_LED1_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE2 (number 47), J3[9]/U15C[5]/PWMA_1B
  @{ */
#define BOARD_LED2_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED2_PIN 2U              /*!<@brief GPIOE pin index: 2 */
#define BOARD_LED2_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE3 (number 48), J3[11]/U15D[9]/PWMA_1A
  @{ */
#define BOARD_LED3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED3_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define BOARD_LED3_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE4 (number 51), J3[5]/U15E[11]/PWMA_2B
  @{ */
#define BOARD_LED4_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED4_PIN 4U              /*!<@brief GPIOE pin index: 4 */
#define BOARD_LED4_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE5 (number 52), J3[7]/U15F[13]/PWMA_2A
  @{ */
#define BOARD_LED5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_LED5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPOTENTIOMETERPins(void);

/*! @name GPIOA6 (number 10), ANTP
  @{ */
#define BOARD_THER_A_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_A_PIN 6U              /*!<@brief GPIOA pin index: 6 */
#define BOARD_THER_A_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOA7 (number 9), ANTN
  @{ */
#define BOARD_THER_B_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_B_PIN 7U              /*!<@brief GPIOA pin index: 7 */
#define BOARD_THER_B_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTHERMISTORPins(void);

/*! @name GPIOC6 (number 31), J1[3]
  @{ */
#define BOARD_ENC_I_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_ENC_I_PIN 6U              /*!<@brief GPIOC pin index: 6 */
#define BOARD_ENC_I_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC7 (number 32), J1[14]/U13[1]/SS0
  @{ */
#define BOARD_SS0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SS0_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define BOARD_SS0_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name GPIOC8 (number 33), J2[10]/U13[2]/MISO0
  @{ */
#define BOARD_MISO0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_MISO0_PIN 8U              /*!<@brief GPIOC pin index: 8 */
#define BOARD_MISO0_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC9 (number 34), J2[12]/U13[6]/SCK0
  @{ */
#define BOARD_SCK0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SCK0_PIN 9U              /*!<@brief GPIOC pin index: 9 */
#define BOARD_SCK0_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC10 (number 35), J2[8]/U13[5]/MOSI0
  @{ */
#define BOARD_MOSI0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_MOSI0_PIN 10U              /*!<@brief GPIOC pin index: 10 */
#define BOARD_MOSI0_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
